---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarBendData.#ctor
source: html/3e725855-09ae-92ef-3d3e-ea26353b1101.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.#ctor Method

Constructs a new RebarBendData with default settings.

## Syntax (C#)
```csharp
public RebarBendData()
```